Revit 2027 API
SpatialElement.Area Property
The area.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Area { get; }
Public ReadOnly Property Area As Double
	Get
public:
property double Area {
	double get ();
}
member Area : float with get
Property Value
Double
See Also
Reference
SpatialElement Class
Autodesk.Revit.DB Namespace